Revit 2024 API
ScrollbarVisibility Enumeration
 Lists all the visibility types of the scrollbar in the preview view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum ScrollbarVisibility
Visual Basic
Public Enumeration ScrollbarVisibility
Visual C++
public enum class ScrollbarVisibility
Members
Member name | Description
None |  No scrollbars are visible.
Horizontal |  The horizontal scrollbar is visible.
Vertical |  The vertical scrollbar is visible.
Both |  The both scrollbars are visible.
See Also
Autodesk.Revit.UI Namespace